Waldosia-jiang/STM32-SOEM-ALC/Nano_kinco_8_version2/USER/soem/nicdrv.c
void ecx_set_pdo_queue(ecx_portt *port, uint32 len, uint32 count) 
{
	cycle_queue_create(&(port->pdo_send_queue),port->pdo_send_buf,ETH_HEADERSIZE + EC_HEADERSIZE + EC_WKCSIZE + EC_HEADERSIZE + 4 + len,count,0);
}

/** Close sockets used
 * @param[in] port        = port context struct
 * @return 0
 */
int ecx_closenic(ecx_portt *port) 
{
   //if (port->sockhandle >= 0) 
     // close(port->sockhandle);
   //if ((port->redport) && (port->redport->sockhandle >= 0))
   //   close(port->redport->sockhandle);
   
   return 0;
}

/** Fill buffer with ethernet header structure.
 * Destination MAC is allways broadcast.
 * Ethertype is allways ETH_P_ECAT.
 * @param[out] p = buffer
 */

uint16 htons(uint16 n)
{
  return ((n & 0xff) << 8) | ((n & 0xff00) >> 8);
}

uint16 ntohs(uint16 n)
{
  return htons(n);
}


void ec_setupheader(void *p) 
{
   ec_etherheadert *bp;
   bp = p;
   bp->da0 = htons(0xffff);
   bp->da1 = htons(0xffff);
   bp->da2 = htons(0xffff);
   bp->sa0 = htons(priMAC[0]);
   bp->sa1 = htons(priMAC[1]);
   bp->sa2 = htons(priMAC[2]);
   bp->etype = htons(ETH_P_ECAT);
}

/** Get new frame identifier index and allocate corresponding rx buffer.
 * @param[in] port        = port context struct
 * @return new index.
 */
int ecx_getindex(ecx_portt *port)
{
   int idx;
   int cnt;

//   pthread_mutex_lock( &(port->getindex_mutex) );

   idx = port->lastidx + 1;
   /* index can't be larger than buffer array */
   if (idx >= EC_MAXBUF) 
   {
      idx = 0;
   }
   cnt = 0;
   /* try to find unused index */
   while ((port->rxbufstat[idx] != EC_BUF_EMPTY) && (cnt < EC_MAXBUF))
   {
      idx++;
      cnt++;
      if (idx >= EC_MAXBUF) 
      {
         idx = 0;
      }
   }
   port->rxbufstat[idx] = EC_BUF_ALLOC;
   if (port->redstate != ECT_RED_NONE)
      port->redport->rxbufstat[idx] = EC_BUF_ALLOC;
   port->lastidx = idx;

//   pthread_mutex_unlock( &(port->getindex_mutex) );
   
   return idx;
}

/** Set rx buffer status.
 * @param[in] port        = port context struct
 * @param[in] idx      = index in buffer array
 * @param[in] bufstat  = status to set
 */
void ecx_setbufstat(ecx_portt *port, int idx, int bufstat)
{
   port->rxbufstat[idx] = bufstat;
   if (port->redstate != ECT_RED_NONE)
      port->redport->rxbufstat[idx] = bufstat;
}

/** Transmit buffer over socket (non blocking).
 * @param[in] port        = port context struct
 * @param[in] idx         = index in tx buffer array
 * @param[in] stacknumber  = 0=Primary 1=Secondary stack
 * @return socket send result
 */
int ecx_outframe(ecx_portt *port, int idx, int stacknumber)
{
   int lp, rval;
   ec_stackT *stack;
	
   uint8 *buffer =  NULL;

   if (!stacknumber)
   {
      stack = &(port->stack);
   }
   else
   {
      stack = &(port->redport->stack);
   }
   
   lp = (*stack->txbuflength)[idx];
   
   if((*stack->txbuf)[idx][0x10] == 0x0C){
      buffer = cycle_queue_push_empty(&(port->pdo_send_queue));
	  if(buffer != NULL && lp == port->pdo_send_queue.element_size){
	     memcpy((uint8*)&buffer[0], (*stack->txbuf)[idx], lp);
	  }
   	}else{
      buffer = (uint8 *)(DMATxDescToSet->Buffer1Addr);
	  memcpy((uint8*)&buffer[0], (*stack->txbuf)[idx], lp);
	  /* Prepare transmit descriptors to give to DMA*/ 
	  ETH_Prepare_Transmit_Descriptors(lp);
   	}
   
	
   //rval = send(*stack->sock, (*stack->txbuf)[idx], lp, 0);
   (*stack->rxbufstat)[idx] = EC_BUF_TX;
   
   return rval;
}

int ecx_pdo_outframe(ecx_portt *port)
{
	uint8 *buffer =  (uint8 *)(DMATxDescToSet->Buffer1Addr);
	if (cycle_queue_peek(&(port->pdo_send_queue), buffer, 0) == 0) {
		
        ETH_Prepare_Transmit_Descriptors(port->pdo_send_queue.element_size);
		cycle_queue_pop(&(port->pdo_send_queue), NULL);
    }
	return 0;
}

/** Transmit buffer over socket (non blocking).
 * @param[in] port        = port context struct
 * @param[in] idx = index in tx buffer array
 * @return socket send result
 */
int ecx_outframe_red(ecx_portt *port, int idx)
{
   uint8 *buffer =  (uint8 *)(DMATxDescToSet->Buffer1Addr);
   ec_comt *datagramP;
   ec_etherheadert *ehp;
   int rval;

   ehp = (ec_etherheadert *)&(port->txbuf[idx]);
   /* rewrite MAC source address 1 to primary */
   ehp->sa1 = htons(priMAC[1]);
   /* transmit over primary socket*/
   rval = ecx_outframe(port, idx, 0);
   if (port->redstate != ECT_RED_NONE)
   {   
//      pthread_mutex_lock( &(port->tx_mutex) );
      ehp = (ec_etherheadert *)&(port->txbuf2);
      /* use dummy frame for secondary socket transmit (BRD) */
      datagramP = (ec_comt*)&(port->txbuf2[ETH_HEADERSIZE]);
      /* write index to frame */
      datagramP->index = idx;
      /* rewrite MAC source address 1 to secondary */
      ehp->sa1 = htons(secMAC[1]);
      /* transmit over secondary socket */
	  
	  memcpy((uint8*)&buffer[0], &(port->txbuf2), port->txbuflength2);
	/* Prepare transmit descriptors to give to DMA*/ 

	  ETH_Prepare_Transmit_Descriptors(port->txbuflength2);
      port->redport->rxbufstat[idx] = EC_BUF_TX;
   }   
   
   return rval;
}

/** Non blocking read of socket. Put frame in temporary buffer.
 * @param[in] port        = port context struct
 * @param[in] stacknumber = 0=primary 1=secondary stack
 * @return >0 if frame is available and read
 */
static int ecx_recvpkt(ecx_portt *port, int stacknumber)
{
   int lp, bytesrx;
   ec_stackT *stack;
   __IO ETH_DMADESCTypeDef *DMARxDesc;
   FrameTypeDef frame;
   uint32_t i=0;  

   if (!stacknumber)
   {
      stack = &(port->stack);
   }
   else
   {
      stack = &(port->redport->stack);
   }
   if (ETH_CheckFrameReceived()){ 
		/* get received frame */
		frame = ETH_Get_Received_Frame();
	}else{
		return 0;
	}
    lp = sizeof(port->tempinbuf);
    bytesrx = frame.length;

	if (bytesrx > lp)
	{
	  bytesrx = lp;
	}
	memcpy(*stack->tempbuf, (uint8 *)frame.buffer, bytesrx);
	
   //bytesrx = recv(*stack->sock, (*stack->tempbuf), lp, 0);
   port->tempinbufs = bytesrx;

   /* Release descriptors to DMA */
  DMARxDesc =frame.descriptor;

  /* Set Own bit in Rx descriptors: gives the buffers back to DMA */
  for (i=0; i<DMA_RX_FRAME_infos->Seg_Count; i++)
  {  
    DMARxDesc->Status = ETH_DMARxDesc_OWN;
    DMARxDesc = (ETH_DMADESCTypeDef *)(DMARxDesc->Buffer2NextDescAddr);
  }
  
  /* Clear Segment_Count */
  DMA_RX_FRAME_infos->Seg_Count =0;
  
  /* When Rx Buffer unavailable flag is set: clear it and resume reception */
  if ((ETH->DMASR & ETH_DMASR_RBUS) != (u32)RESET)  
  {
    /* Clear RBUS ETHERNET DMA flag */
    ETH->DMASR = ETH_DMASR_RBUS;
    /* Resume DMA reception */
    ETH->DMARPDR = 0;
  }
   return (bytesrx > 0);
}

